import numpy as np
import math
#1 Введіть з клавіатури в масив п'ять цілочисельних значень. Виведіть їх в один рядок через кому. Отримайте для масиву середнє арифметичне.
a = np.array([1,2,3,4,5])
print(a)
print('Среднее арифметическое = ', np.average(a))

print('-------------')
#2 Введіть з клавіатури п'ять цілочисельних елементів масиву X. Виведіть на екран значення коренів і квадратів кожного з елементів масиву.
x = np.array([1,2,3,4,5])
sqrt = x ** (0.5)
print('Квадрат : ', x**2)
print('Корень : ',sqrt)

print('-------------')
#3 Створіть масив з п'яти прізвищ і виведіть їх на екран стовпчиком, починаючи з останнього.
y = np.array(['Egor', 'Slava', 'Vitya', 'Max', 'Dima'])
for i in y [::-1]:
    print(i)

print('-------------')
#4 Створіть масив з п'яти прізвищ і виведіть на екран ті, які починаються з певної букви, яка вводиться з клавіатури.
x = np.array(['Иванов','Сидорович','Меченый','Волк','Седой'])


print('-------------')
#5 Створіть масив А [0..7] за допомогою генератора випадкових чисел і виведіть його на екран. Збільште всі його елементи в 2 рази.
rd = np.random.randint(0, 7, 7)
print(rd)
rd = rd*2
print(rd)

print('-------------')